/*
 *
 *  Created on: 2020年10月1日
 *      Author: Lzy
 */
#include "ad_devtype.h"

#define ZPDU_SN_MIN_NUM 0
#define ZPDU_SN_MAX_NUM 1000

#define MPDU_SN_MIN_NUM 1000
#define MPDU_SN_MAX_NUM 2000

#define RPDU_SN_MIN_NUM 2000
#define RPDU_SN_MAX_NUM 3000

#define SI_SN_MIN_NUM  3000
#define SI_SN_MAX_NUM  4000

#define IP_SN_MIN_NUM  4000
#define IP_SN_MAX_NUM  5000

#define BM_SN_MIN_NUM  5000
#define BM_SN_MAX_NUM  6000


Ad_DevType::Ad_DevType()
{
    mPacket = sDataPacket::bulid();
    mDt = mPacket->devType;
}


Ad_DevType * Ad_DevType::bulid()
{
    static  Ad_DevType* sington = nullptr;
    if(sington == nullptr)
        sington = new  Ad_DevType();
    return sington;
}



bool Ad_DevType::analysDevType(uint id)
{
    if(id < ZPDU_SN_MAX_NUM) {
        mDt->devType = 1;
        zpduDevType(id, mDt);
        mPacket->dev_type = zpduStrs(id);
    } else if(id < MPDU_SN_MAX_NUM) {

    } else if(id < RPDU_SN_MAX_NUM) {

    } else if(id < SI_SN_MAX_NUM) {

    } else if(id < IP_SN_MAX_NUM) {

    } else if(id < BM_SN_MAX_NUM) {

    }



    return true;
}


void Ad_DevType::zpduDevType(uint id, sDevType *dt)
{
    if(id < 0x20) {
        dt->specs = 2;
    } else {
        dt->specs = 1;
    }

    dt->ac = 1; // 交流
    dt->lines = 1; // 单相
}

QString Ad_DevType::zpduStrs(uint id)
{
    QStringList list;
    list << "ZPDU"
         <<  "ZPDU_交流_锰铜_A系列_单相_4位" //0x0000 0001
         << "ZPDU_交流_锰铜_B系列_单相_4位" //0x0000 0002
         << "ZPDU_交流_锰铜_C系列_单相_4位" //0x0000 0003
         << "ZPDU_交流_锰铜_D系列_单相_4位" //0x0000 0004

         << "ZPDU_交流_锰铜_A系列_单相_8位" //0x0000 0005
         << "ZPDU_交流_锰铜_B系列_单相_8位" //0x0000 0006
         << "ZPDU_交流_锰铜_C系列_单相_8位" //0x0000 0007
         << "ZPDU_交流_锰铜_D系列_单相_8位" //0x0000 0008

         << "ZPDU_交流_锰铜_A系列_单相_12位" //0x0000 0009
         << "ZPDU_交流_锰铜_B系列_单相_12位" //0x0000 000A
         << "ZPDU_交流_锰铜_C系列_单相_12位" //0x0000 000B
         << "ZPDU_交流_锰铜_D系列_单相_12位" //0x0000 000C

         << "ZPDU_交流_锰铜_A系列_单相_14位" //0x0000 000D
         << "ZPDU_交流_锰铜_B系列_单相_14位" //0x0000 000E
         << "ZPDU_交流_锰铜_C系列_单相_14位" //0x0000 000F
         << "ZPDU_交流_锰铜_D系列_单相_14位" //0x0000 0010

         << "ZPDU_交流_锰铜_A系列_三相_4位" //0x0000 0011
         << "ZPDU_交流_锰铜_B系列_三相_4位" //0x0000 0012
         << "ZPDU_交流_锰铜_C系列_三相_4位" //0x0000 0013
         << "ZPDU_交流_锰铜_D系列_三相_4位" //0x0000 0014

         << "ZPDU_交流_锰铜_A系列_三相_8位" //0x0000 0015
         << "ZPDU_交流_锰铜_B系列_三相_8位" //0x0000 0016
         << "ZPDU_交流_锰铜_C系列_三相_8位" //0x0000 0017
         << "ZPDU_交流_锰铜_D系列_三相_8位" //0x0000 0018

         << "ZPDU_交流_锰铜_A系列_三相_12位" //0x0000 0019
         << "ZPDU_交流_锰铜_B系列_三相_12位" //0x0000 001A
         << "ZPDU_交流_锰铜_C系列_三相_12位" //0x0000 001B
         << "ZPDU_交流_锰铜_D系列_三相_12位" //0x0000 001C

         << "ZPDU_交流_锰铜_A系列_三相_14位" //0x0000 001D
         << "ZPDU_交流_锰铜_B系列_三相_14位" //0x0000 001E
         << "ZPDU_交流_锰铜_C系列_三相_14位" //0x0000 001F
         << "ZPDU_交流_锰铜_D系列_三相_14位" //0x0000 0020

         << "ZPDU_交流_互感器_A系列_单相_4位" //0x0000 0021
         << "ZPDU_交流_互感器_B系列_单相_4位" //0x0000 0022
         << "ZPDU_交流_互感器_C系列_单相_4位" //0x0000 0023
         << "ZPDU_交流_互感器_D系列_单相_4位" //0x0000 0024

         << "ZPDU_交流_互感器_A系列_单相_8位" //0x0000 0025
         << "ZPDU_交流_互感器_B系列_单相_8位" //0x0000 0026
         << "ZPDU_交流_互感器_C系列_单相_8位" //0x0000 0027
         << "ZPDU_交流_互感器_D系列_单相_8位" //0x0000 0028

         << "ZPDU_交流_互感器_A系列_单相_12位" //0x0000 0029
         << "ZPDU_交流_互感器_B系列_单相_12位" //0x0000 002A
         << "ZPDU_交流_互感器_C系列_单相_12位" //0x0000 002B
         << "ZPDU_交流_互感器_D系列_单相_12位" //0x0000 002C

         << "ZPDU_交流_互感器_A系列_单相_14位" //0x0000 002D
         << "ZPDU_交流_互感器_B系列_单相_14位" //0x0000 002E
         << "ZPDU_交流_互感器_C系列_单相_14位" //0x0000 002F
         << "ZPDU_交流_互感器_D系列_单相_14位" //0x0000 0030

         << "ZPDU_交流_互感器_A系列_三相_4位" //0x0000 0031
         << "ZPDU_交流_互感器_B系列_三相_4位" //0x0000 0032
         << "ZPDU_交流_互感器_C系列_三相_4位" //0x0000 0033
         << "ZPDU_交流_互感器_D系列_三相_4位" //0x0000 0034

         << "ZPDU_交流_互感器_A系列_三相_8位" //0x0000 0035
         << "ZPDU_交流_互感器_B系列_三相_8位" //0x0000 0036
         << "ZPDU_交流_互感器_C系列_三相_8位" //0x0000 0037
         << "ZPDU_交流_互感器_D系列_三相_8位" //0x0000 0038

         << "ZPDU_交流_互感器_A系列_三相_12位" //0x0000 0039
         << "ZPDU_交流_互感器_B系列_三相_12位" //0x0000 003A
         << "ZPDU_交流_互感器_C系列_三相_12位" //0x0000 003B
         << "ZPDU_交流_互感器_D系列_三相_12位" //0x0000 003C

         << "ZPDU_交流_互感器_A系列_三相_14位" //0x0000 003D
         << "ZPDU_交流_互感器_B系列_三相_14位" //0x0000 003E
         << "ZPDU_交流_互感器_C系列_三相_14位" //0x0000 003F
         << "ZPDU_交流_互感器_D系列_三相_14位" //0x0000 0040

         << "ZPDU_磁保持_锰铜_C系列_单相_4位" //0x0000 0041
         << "ZPDU_磁保持_锰铜_D系列_单相_4位" //0x0000 0042

         << "ZPDU_磁保持_锰铜_C系列_单相_8位" //0x0000 0043
         << "ZPDU_磁保持_锰铜_D系列_单相_8位" //0x0000 0044

         << "ZPDU_磁保持_锰铜_C系列_单相_12位" //0x0000 0045
         << "ZPDU_磁保持_锰铜_D系列_单相_12位" //0x0000 0046

         << "ZPDU_磁保持_锰铜_C系列_单相_14位" //0x0000 0047
         << "ZPDU_磁保持_锰铜_D系列_单相_14位" //0x0000 0048

         << "ZPDU_磁保持_锰铜_C系列_三相_4位" //0x0000 0049
         << "ZPDU_磁保持_锰铜_D系列_三相_4位" //0x0000 004A

         << "ZPDU_磁保持_锰铜_C系列_三相_8位" //0x0000 004B
         << "ZPDU_磁保持_锰铜_D系列_三相_8位" //0x0000 004C

         << "ZPDU_磁保持_锰铜_C系列_三相_12位" //0x0000 004D
         << "ZPDU_磁保持_锰铜_D系列_三相_12位" //0x0000 004E

         << "ZPDU_磁保持_锰铜_C系列_三相_14位" //0x0000 004F
         << "ZPDU_磁保持_锰铜_D系列_三相_14位" //0x0000 0050

         << "ZPDU_磁保持_互感器_C系列_单相_4位" //0x0000 0051
         << "ZPDU_磁保持_互感器_D系列_单相_4位" //0x0000 0052

         << "ZPDU_磁保持_互感器_C系列_单相_8位" //0x0000 0053
         << "ZPDU_磁保持_互感器_D系列_单相_8位" //0x0000 0054

         << "ZPDU_磁保持_互感器_C系列_单相_12位" //0x0000 0055
         << "ZPDU_磁保持_互感器_D系列_单相_12位" //0x0000 0056

         << "ZPDU_磁保持_互感器_C系列_单相_14位" //0x0000 0057
         << "ZPDU_磁保持_互感器_D系列_单相_14位" //0x0000 0058

         << "ZPDU_磁保持_互感器_C系列_三相_4位" //0x0000 0059
         << "ZPDU_磁保持_互感器_D系列_三相_4位" //0x0000 005A

         << "ZPDU_磁保持_互感器_C系列_三相_8位" //0x0000 005B
         << "ZPDU_磁保持_互感器_D系列_三相_8位" //0x0000 005C

         << "ZPDU_磁保持_互感器_C系列_三相_12位" //0x0000 005D
         << "ZPDU_磁保持_互感器_D系列_三相_12位" //0x0000 005E

         << "ZPDU_磁保持_互感器_C系列_三相_14位" //0x0000 005F
         << "ZPDU_磁保持_互感器_D系列_三相_14位" //0x0000 0060
            ;

    id -= ZPDU_SN_MIN_NUM;
    return list.at(id);
}
